In [219]:
import pandas as pd #tablas https://pandas.pydata.org/docs/user_guide/pyarrow.html
import numpy as np #estadistica https://numpy.org/doc/1.25/user/index.html#user
import matplotlib.pyplot as plt #gráficos https://matplotlib.org/stable/plot_types/index.html
import seaborn as sns #gráficos https://seaborn.pydata.org/tutorial/regression.html
from sklearn import linear_model #modelo de regresion https://scikit-learn.org/stable/
from sklearn.preprocessing import MinMaxScaler # do not use the function Normalise() - it does something entirely different
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from datetime import datetime #https://docs.python.org/3/library/datetime.html
from datetime import timedelta #this is a good time to learn about dates and timestamps. You can find some info here:
from sklearn.linear_model import LogisticRegression
from sklearn.utils import resample
from imblearn.over_sampling import SMOTE
from sklearn.metrics import confusion_matrix
from sklearn.metrics import precision_score
from sklearn.metrics import recall_score
from sklearn.metrics import f1_score
from sklearn.neighbors import KNeighborsClassifier
from scipy.stats import ttest_1samp
import scipy.stats as st
from sklearn.neighbors import KNeighborsClassifier
from mlxtend.plotting import plot_decision_regions
import pandas as pd
import numpy as np
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass  # To get the password without showing the input

In [220]:
exdt = pd.read_csv('expiration_date_KEY.csv')

In [221]:
exdt['expiration_date'] = pd.to_datetime(exdt['expiration_date'])

1. BRINGING MUSK TWEETS

In [222]:
password = getpass()

In [223]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/raw_data'
engine = create_engine(connection_string)
query = '''SELECT * FROM tesla_tweets_raw;'''

musk = pd.read_sql_query(query, engine)

In [224]:
musk

,company_id,date,username,tweet,retweets_count,likes_count
0,TSLA,2010-06-04,elonmusk,"Please ignore prior tweets, as that was someon...",349,4710
1,TSLA,2011-12-01,elonmusk,Went to Iceland on Sat to ride bumper cars on ...,16,191
2,TSLA,2011-12-01,elonmusk,I made the volume on the Model S http://t.co/...,9,79
3,TSLA,2011-12-03,elonmusk,"Great Voltaire quote, arguably better than Twa...",24,30
4,TSLA,2011-12-03,elonmusk,That was a total non sequitur btw,6,52
...,...,...,...,...,...,...
12557,TSLA,2021-04-17,elonmusk,Everything to the moon!,42839,300427
12558,TSLA,2021-04-17,elonmusk,@neuralink @shivon Great review! Neuralink is ...,628,6155
12559,TSLA,2021-04-17,elonmusk,"If we make life multiplanetary, there may come...",8411,87303
12560,TSLA,2021-04-17,elonmusk,Dragon spacecraft &amp; Falcon 9 rocket https...,5355,64372
12561,TSLA,2021-04-17,elonmusk,@WhatsupFranks Great progress by Tesla team,167,3480

In [225]:
musk['date'] = pd.to_datetime(musk['date'])

2. We are going to add a column at the end with the expiration dates, so we can then count the tweets, sum the number of retweets and likes in the period. FIRST: QUIT ALL TWEETS BEFORE 2013-01-01

In [226]:
musk_13 = musk[musk["date"] >= "2013-01-01"]
musk_13

,company_id,date,username,tweet,retweets_count,likes_count
315,TSLA,2013-01-04,elonmusk,This gives a sense of what Mars would look lik...,290,155
316,TSLA,2013-01-04,elonmusk,Nice story about a Model S coast to coast road...,147,63
317,TSLA,2013-01-10,elonmusk,"Also, I am not the kale eating overlord of Mar...",60,58
318,TSLA,2013-01-10,elonmusk,"To be super clear, I don't wish to (nor could ...",175,85
319,TSLA,2013-01-16,elonmusk,What it feels like to ride a rocket http://t...,169,119
...,...,...,...,...,...,...
12557,TSLA,2021-04-17,elonmusk,Everything to the moon!,42839,300427
12558,TSLA,2021-04-17,elonmusk,@neuralink @shivon Great review! Neuralink is ...,628,6155
12559,TSLA,2021-04-17,elonmusk,"If we make life multiplanetary, there may come...",8411,87303
12560,TSLA,2021-04-17,elonmusk,Dragon spacecraft &amp; Falcon 9 rocket https...,5355,64372
12561,TSLA,2021-04-17,elonmusk,@WhatsupFranks Great progress by Tesla team,167,3480

LETS BRING CODE FROM tesla_stock_cleaning

In [227]:
musk_date = musk_13.merge(exdt, how='left', left_on='date', right_on='expiration_date')

In [228]:
musk_date.tail(10)

,company_id,date,username,tweet,retweets_count,likes_count,expiration_date
12237,TSLA,2021-04-16,elonmusk,"@Erdayastronaut @thesheetztweetz Yeah, should ...",549,7885,2021-04-16
12238,TSLA,2021-04-16,elonmusk,@thesheetztweetz This is accurate. Service upt...,365,8076,2021-04-16
12239,TSLA,2021-04-16,elonmusk,@sadiaslayy @DogecoinBets 😮,3611,40139,2021-04-16
12240,TSLA,2021-04-17,elonmusk,🚀🖤💫 NASA Rules!! 💫🖤🚀,13350,135461,NaT
12241,TSLA,2021-04-17,elonmusk,We are honored to be part of the @NASAArtemis ...,2509,51682,NaT
12242,TSLA,2021-04-17,elonmusk,Everything to the moon!,42839,300427,NaT
12243,TSLA,2021-04-17,elonmusk,@neuralink @shivon Great review! Neuralink is ...,628,6155,NaT
12244,TSLA,2021-04-17,elonmusk,"If we make life multiplanetary, there may come...",8411,87303,NaT
12245,TSLA,2021-04-17,elonmusk,Dragon spacecraft &amp; Falcon 9 rocket https...,5355,64372,NaT
12246,TSLA,2021-04-17,elonmusk,@WhatsupFranks Great progress by Tesla team,167,3480,NaT

PROBLEM! THIS GUY LIKES TO TWEET ON THE SAME DATE, WE NEED TO FIX THIS

In [229]:
musk_13

,company_id,date,username,tweet,retweets_count,likes_count
315,TSLA,2013-01-04,elonmusk,This gives a sense of what Mars would look lik...,290,155
316,TSLA,2013-01-04,elonmusk,Nice story about a Model S coast to coast road...,147,63
317,TSLA,2013-01-10,elonmusk,"Also, I am not the kale eating overlord of Mar...",60,58
318,TSLA,2013-01-10,elonmusk,"To be super clear, I don't wish to (nor could ...",175,85
319,TSLA,2013-01-16,elonmusk,What it feels like to ride a rocket http://t...,169,119
...,...,...,...,...,...,...
12557,TSLA,2021-04-17,elonmusk,Everything to the moon!,42839,300427
12558,TSLA,2021-04-17,elonmusk,@neuralink @shivon Great review! Neuralink is ...,628,6155
12559,TSLA,2021-04-17,elonmusk,"If we make life multiplanetary, there may come...",8411,87303
12560,TSLA,2021-04-17,elonmusk,Dragon spacecraft &amp; Falcon 9 rocket https...,5355,64372
12561,TSLA,2021-04-17,elonmusk,@WhatsupFranks Great progress by Tesla team,167,3480

In [230]:
aggregated_musk_13 = musk_13.groupby('date').agg({'tweet': 'count', 'retweets_count': 'sum', 'likes_count': 'sum'}).reset_index()

In [231]:
aggregated_musk_13

           date  tweet  retweets_count  likes_count
0    2013-01-04      2             437          218
1    2013-01-10      2             235          143
2    2013-01-16      1             169          119
3    2013-01-18      1             557          237
4    2013-01-26      1             200          103
...         ...    ...             ...          ...
1874 2021-04-13      1            1192        26888
1875 2021-04-14      8            3814       117751
1876 2021-04-15     22          106251       988396
1877 2021-04-16      9           67406       761110
1878 2021-04-17      7           73259       648880

[1879 rows x 4 columns]

HE DOESNT TWEETS ON ALL EXPIRATION DATES, THEREFORE, IF WE ADD A COLUMN WITH ALL THE DAYS SINCE 2013-01-01 up to 2021-04-17, we feel the days that are not used with Nan, then we change the Nan for 0 AND THEN WE MERGE

In [232]:
aggregated_musk_13

           date  tweet  retweets_count  likes_count
0    2013-01-04      2             437          218
1    2013-01-10      2             235          143
2    2013-01-16      1             169          119
3    2013-01-18      1             557          237
4    2013-01-26      1             200          103
...         ...    ...             ...          ...
1874 2021-04-13      1            1192        26888
1875 2021-04-14      8            3814       117751
1876 2021-04-15     22          106251       988396
1877 2021-04-16      9           67406       761110
1878 2021-04-17      7           73259       648880

[1879 rows x 4 columns]

In [233]:
start_date = '2013-01-01'
end_date = '2021-04-17'
date_range = pd.date_range(start=start_date, end=end_date, freq='D')
date_df = pd.DataFrame({'date_daily': date_range})

In [234]:
date_df

     date_daily
0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
4    2013-01-05
...         ...
3024 2021-04-13
3025 2021-04-14
3026 2021-04-15
3027 2021-04-16
3028 2021-04-17

[3029 rows x 1 columns]

In [235]:
musk_all_days = date_df.merge(aggregated_musk_13, how='left', left_on='date_daily', right_on='date')

In [236]:
musk_all_days

     date_daily       date  tweet  retweets_count  likes_count
0    2013-01-01        NaT    NaN             NaN          NaN
1    2013-01-02        NaT    NaN             NaN          NaN
2    2013-01-03        NaT    NaN             NaN          NaN
3    2013-01-04 2013-01-04    2.0           437.0        218.0
4    2013-01-05        NaT    NaN             NaN          NaN
...         ...        ...    ...             ...          ...
3024 2021-04-13 2021-04-13    1.0          1192.0      26888.0
3025 2021-04-14 2021-04-14    8.0          3814.0     117751.0
3026 2021-04-15 2021-04-15   22.0        106251.0     988396.0
3027 2021-04-16 2021-04-16    9.0         67406.0     761110.0
3028 2021-04-17 2021-04-17    7.0         73259.0     648880.0

[3029 rows x 5 columns]

In [237]:
musk_all_days=musk_all_days.fillna(0)
musk_all_days

     date_daily                 date  tweet  retweets_count  likes_count
0    2013-01-01                    0    0.0             0.0          0.0
1    2013-01-02                    0    0.0             0.0          0.0
2    2013-01-03                    0    0.0             0.0          0.0
3    2013-01-04  2013-01-04 00:00:00    2.0           437.0        218.0
4    2013-01-05                    0    0.0             0.0          0.0
...         ...                  ...    ...             ...          ...
3024 2021-04-13  2021-04-13 00:00:00    1.0          1192.0      26888.0
3025 2021-04-14  2021-04-14 00:00:00    8.0          3814.0     117751.0
3026 2021-04-15  2021-04-15 00:00:00   22.0        106251.0     988396.0
3027 2021-04-16  2021-04-16 00:00:00    9.0         67406.0     761110.0
3028 2021-04-17  2021-04-17 00:00:00    7.0         73259.0     648880.0

[3029 rows x 5 columns]

In [239]:
musk_date_fixed = musk_all_days.merge(exdt, how='left', left_on='date_daily', right_on='expiration_date')

In [240]:
musk_date_fixed

,date_daily,date,tweet,retweets_count,likes_count,expiration_date
0,2013-01-01,0,0.0,0.0,0.0,NaT
1,2013-01-02,0,0.0,0.0,0.0,NaT
2,2013-01-03,0,0.0,0.0,0.0,NaT
3,2013-01-04,2013-01-04 00:00:00,2.0,437.0,218.0,NaT
4,2013-01-05,0,0.0,0.0,0.0,NaT
...,...,...,...,...,...,...
3024,2021-04-13,2021-04-13 00:00:00,1.0,1192.0,26888.0,NaT
3025,2021-04-14,2021-04-14 00:00:00,8.0,3814.0,117751.0,NaT
3026,2021-04-15,2021-04-15 00:00:00,22.0,106251.0,988396.0,NaT
3027,2021-04-16,2021-04-16 00:00:00,9.0,67406.0,761110.0,2021-04-16
3028,2021-04-17,2021-04-17 00:00:00,7.0,73259.0,648880.0,NaT

Getting the ranges

In [241]:
indexes = musk_date_fixed [musk_date_fixed ['expiration_date'].notnull()].index

In [242]:
indexes

Int64Index([  17,   45,   73,  108,  136,  171,  199,  227,  262,  290,  318,
             353,  381,  416,  444,  500,  535,  563,  591,  626,  654,  689,
             717,  745,  780,  808,  836,  864,  899,  927,  962,  990, 1018,
            1053, 1081, 1109, 1144, 1172, 1200, 1235, 1263, 1291, 1326, 1354,
            1389, 1417, 1445, 1480, 1508, 1536, 1571, 1599, 1627, 1662, 1690,
            1718, 1753, 1781, 1809, 1844, 1872, 1900, 1935, 1963, 1991, 2026,
            2054, 2089, 2117, 2145, 2180, 2208, 2236, 2264, 2327, 2362, 2390,
            2418, 2453, 2481, 2509, 2544, 2572, 2607, 2635, 2663, 2691, 2726,
            2754, 2789, 2817, 2845, 2880, 2908, 2936, 2971, 2999, 3027],
           dtype='int64')

Adding 0 at the begging we also want to know about the tweets in period 1

In [243]:
indexes_0 = np.insert(indexes, 0, 0)
indexes_0

Int64Index([   0,   17,   45,   73,  108,  136,  171,  199,  227,  262,  290,
             318,  353,  381,  416,  444,  500,  535,  563,  591,  626,  654,
             689,  717,  745,  780,  808,  836,  864,  899,  927,  962,  990,
            1018, 1053, 1081, 1109, 1144, 1172, 1200, 1235, 1263, 1291, 1326,
            1354, 1389, 1417, 1445, 1480, 1508, 1536, 1571, 1599, 1627, 1662,
            1690, 1718, 1753, 1781, 1809, 1844, 1872, 1900, 1935, 1963, 1991,
            2026, 2054, 2089, 2117, 2145, 2180, 2208, 2236, 2264, 2327, 2362,
            2390, 2418, 2453, 2481, 2509, 2544, 2572, 2607, 2635, 2663, 2691,
            2726, 2754, 2789, 2817, 2845, 2880, 2908, 2936, 2971, 2999, 3027],
           dtype='int64')

In [244]:
def convert_to_ranges(index_array):
    ranges = []
    start_index = index_array[0]
    for i in range(1, len(index_array)):
        ranges.append((start_index, index_array[i]+1))
        start_index = index_array[i]+1
    ranges.append((start_index, index_array[-1]))
    return ranges

index_ranges = convert_to_ranges(indexes_0) 
index_ranges

[(0, 18),
 (18, 46),
 (46, 74),
 (74, 109),
 (109, 137),
 (137, 172),
 (172, 200),
 (200, 228),
 (228, 263),
 (263, 291),
 (291, 319),
 (319, 354),
 (354, 382),
 (382, 417),
 (417, 445),
 (445, 501),
 (501, 536),
 (536, 564),
 (564, 592),
 (592, 627),
 (627, 655),
 (655, 690),
 (690, 718),
 (718, 746),
 (746, 781),
 (781, 809),
 (809, 837),
 (837, 865),
 (865, 900),
 (900, 928),
 (928, 963),
 (963, 991),
 (991, 1019),
 (1019, 1054),
 (1054, 1082),
 (1082, 1110),
 (1110, 1145),
 (1145, 1173),
 (1173, 1201),
 (1201, 1236),
 (1236, 1264),
 (1264, 1292),
 (1292, 1327),
 (1327, 1355),
 (1355, 1390),
 (1390, 1418),
 (1418, 1446),
 (1446, 1481),
 (1481, 1509),
 (1509, 1537),
 (1537, 1572),
 (1572, 1600),
 (1600, 1628),
 (1628, 1663),
 (1663, 1691),
 (1691, 1719),
 (1719, 1754),
 (1754, 1782),
 (1782, 1810),
 (1810, 1845),
 (1845, 1873),
 (1873, 1901),
 (1901, 1936),
 (1936, 1964),
 (1964, 1992),
 (1992, 2027),
 (2027, 2055),
 (2055, 2090),
 (2090, 2118),
 (2118, 2146),
 (2146, 2181),
 (2181, 2209),
 (2209, 2237),
 (2237, 2265),
 (2265, 2328),
 (2328, 2363),
 (2363, 2391),
 (2391, 2419),
 (2419, 2454),
 (2454, 2482),
 (2482, 2510),
 (2510, 2545),
 (2545, 2573),
 (2573, 2608),
 (2608, 2636),
 (2636, 2664),
 (2664, 2692),
 (2692, 2727),
 (2727, 2755),
 (2755, 2790),
 (2790, 2818),
 (2818, 2846),
 (2846, 2881),
 (2881, 2909),
 (2909, 2937),
 (2937, 2972),
 (2972, 3000),
 (3000, 3028),
 (3028, 3027)]

In [245]:
musk_date_fixed.iloc[1145:1173]

,date_daily,date,tweet,retweets_count,likes_count,expiration_date
1145,2016-02-20,2016-02-20 00:00:00,1.0,690.0,3318.0,NaT
1146,2016-02-21,2016-02-21 00:00:00,1.0,645.0,3444.0,NaT
1147,2016-02-22,2016-02-22 00:00:00,2.0,1270.0,3405.0,NaT
1148,2016-02-23,2016-02-23 00:00:00,1.0,50.0,135.0,NaT
1149,2016-02-24,2016-02-24 00:00:00,2.0,4798.0,7378.0,NaT
1150,2016-02-25,0,0.0,0.0,0.0,NaT
1151,2016-02-26,0,0.0,0.0,0.0,NaT
1152,2016-02-27,2016-02-27 00:00:00,4.0,40.0,308.0,NaT
1153,2016-02-28,2016-02-28 00:00:00,1.0,6.0,81.0,NaT
1154,2016-02-29,2016-02-29 00:00:00,2.0,2800.0,4226.0,NaT
1155,2016-03-01,2016-03-01 00:00:00,3.0,1538.0,3934.0,NaT
1156,2016-03-02,2016-03-02 00:00:00,4.0,1943.0,5657.0,NaT
1157,2016-03-03,0,0.0,0.0,0.0,NaT
1158,2016-03-04,2016-03-04 00:00:00,1.0,70.0,217.0,NaT
1159,2016-03-05,2016-03-05 00:00:00,3.0,5787.0,16212.0,NaT
1160,2016-03-06,0,0.0,0.0,0.0,NaT
1161,2016-03-07,2016-03-07 00:00:00,2.0,3581.0,9725.0,NaT
1162,2016-03-08,0,0.0,0.0,0.0,NaT
1163,2016-03-09,2016-03-09 00:00:00,3.0,2262.0,7169.0,NaT
1164,2016-03-10,0,0.0,0.0,0.0,NaT
1165,2016-03-11,0,0.0,0.0,0.0,NaT
1166,2016-03-12,0,0.0,0.0,0.0,NaT
1167,2016-03-13,0,0.0,0.0,0.0,NaT
1168,2016-03-14,0,0.0,0.0,0.0,NaT
1169,2016-03-15,0,0.0,0.0,0.0,NaT
1170,2016-03-16,0,0.0,0.0,0.0,NaT
1171,2016-03-17,0,0.0,0.0,0.0,NaT
1172,2016-03-18,2016-03-18 00:00:00,2.0,11.0,141.0,2016-03-18

In [246]:
tweet_count = [musk_date_fixed.loc[start:end, 'tweet'].sum() for start, end in index_ranges]

In [247]:
#IMPORTANT TO QUIT THE LAST ROW

tweet_count = tweet_count[:-1]

In [248]:
retweet_count_per = [musk_date_fixed.loc[start:end, 'retweets_count'].sum() for start, end in index_ranges]

In [249]:
likes_count_per = [musk_date_fixed.loc[start:end, 'likes_count'].sum() for start, end in index_ranges]

In [250]:
retweet_count_per = retweet_count_per[:-1]
likes_count_per = likes_count_per[:-1]

In [251]:
musk_filtered_tweets = exdt.copy()

In [252]:
musk_filtered_tweets

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [253]:
musk_tweets_info_2013_2021["company_id"]="TSLA"
musk_tweets_info_2013_2021["username"]="elonmusk"
musk_tweets_info_2013_2021["tweet_count"] = tweet_count
musk_tweets_info_2013_2021["likes_count"] = likes_count_per
musk_tweets_info_2013_2021["retweet_count"] = retweet_count_per

/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_9940/3195170304.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  musk_tweets_info_2013_2021["company_id"]="TSLA"
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_9940/3195170304.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  musk_tweets_info_2013_2021["username"]="elonmusk"
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_9940/3195170304.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  musk_tweets_info_2013_2021["tweet_count"] = tweet_count
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_9940/3195170304.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  musk_tweets_info_2013_2021["likes_count"] = likes_count_per
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_9940/3195170304.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  musk_tweets_info_2013_2021["retweet_count"] = retweet_count_per

In [254]:
musk_tweets_info_2013_2021

,expiration_date,company_id,username,tweet_count,likes_count,retweet_count
0,2013-01-18,TSLA,elonmusk,6.0,717.0,1398.0
1,2013-02-15,TSLA,elonmusk,20.0,2596.0,5011.0
2,2013-03-15,TSLA,elonmusk,38.0,4032.0,8408.0
3,2013-04-19,TSLA,elonmusk,73.0,6473.0,8811.0
4,2013-05-17,TSLA,elonmusk,89.0,6750.0,7147.0
...,...,...,...,...,...,...
93,2020-12-18,TSLA,elonmusk,136.0,4927673.0,297340.0
94,2021-01-15,TSLA,elonmusk,216.0,12324923.0,934095.0
95,2021-02-19,TSLA,elonmusk,268.0,27188806.0,2475305.0
96,2021-03-19,TSLA,elonmusk,217.0,15183649.0,1076158.0
97,2021-04-16,TSLA,elonmusk,241.0,15306822.0,1214566.0

SEND TO SQL

In [255]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/musk_twt_tesla_stock'
engine = create_engine(connection_string)

In [256]:
#musk_tweets_info_2013_2021.to_sql('musk_tweets_info_2013_2021', engine, if_exists='append', index=False)

98